Revit 2027 API
BuiltInFailures.LoadFailures.InvalidAreaLoadSketchError Property
 Area Load has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
Public Shared ReadOnly Property InvalidAreaLoadSketchError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidAreaLoadSketchError {
	FailureDefinitionId^ get ();
}
static member InvalidAreaLoadSketchError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace